### Task 23 - Apply and Map:

#### 1.Write a program that uses map() to square each number in the list:
[1, 2, 3, 4, 5]

In [15]:
numbers = [1, 2, 3, 4, 5]

squared_numbers = list(map(lambda x: x**2, numbers))

print(squared_numbers)

[1, 4, 9, 16, 25]

#### 2.Use lambda and map() to double the numbers in this list:
[10, 20, 30]

In [17]:
numbers = [10, 20, 30]

doubled_numbers = list(map(lambda x: x*2, numbers))

print(doubled_numbers)

[20, 40, 60]

#### 3.Convert the list ['apple', 'banana', 'cherry'] to uppercase using map().

In [21]:
fruits = ['apple', 'banana', 'cherry']

FRUITS = list(map(str.upper, fruits))

print(FRUITS)

['APPLE', 'BANANA', 'CHERRY']

#### 4.Given ['dog', 'elephant', 'cat'], use map() to create a list of the lengths of each string.

In [23]:
animals = ['dog', 'elephant', 'cat']

lengths = list(map(len, animals))

print(lengths)

[3, 8, 3]

#### 5.Create a DataFrame with a column 'Name':

import pandas as pd  

df = pd.DataFrame({'Name': ['ALICE', 'BOB', 'CHARLIE']})

Use apply() to convert all names to lowercase.

In [31]:
import pandas as pd

df = pd.DataFrame({'Name': ['ALICE', 'BOB', 'CHARLIE']})
print(df)

      Name
0    ALICE
1      BOB
2  CHARLIE

In [33]:
df['Name'] = df['Name'].apply(str.lower)
print(df)

      Name
0    alice
1      bob
2  charlie

#### 6.Using apply() with a custom function

#### 7.Use the following function with apply() on the column 'Age':
        def age_group(age):
            return 'Adult' if age >= 18 else 'Child'
        df = pd.DataFrame({'Age': [10, 20, 15, 30]})

In [61]:
def age_group(age):
        return 'Adult' if age >= 18 else 'Child'

df = pd.DataFrame({'Age': [10, 20, 15, 30]})
print(df)

   Age
0   10
1   20
2   15
3   30

In [63]:
df['Category'] = df['Age'].apply(age_group)
print(df)

   Age Category
0   10    Child
1   20    Adult
2   15    Child
3   30    Adult

#### 8.Use a lambda function to add 5 to each value in this DataFrame column 'Marks':
df = pd.DataFrame({'Marks': [45, 67, 89]})

In [67]:
df = pd.DataFrame({'Marks': [45, 67, 89]})
print(df)

   Marks
0     45
1     67
2     89

In [71]:
df['Updated_Marks'] = df['Marks'].apply(lambda x:x+5)
print(df)

   Marks  Updated_Marks
0     45             50
1     67             72
2     89             94

#### 9.Use map() with a lambda function to add the values of two lists:
a = [1, 2, 3]
b = [4, 5, 6]

In [73]:
a = [1, 2, 3] 
b = [4, 5, 6]

result = list(map(lambda x,y : x+y, a,b))
print(result)

[5, 7, 9]

#### 10.Create a DataFrame with column 'City' = ['new york', 'paris', 'london'].
Use apply() to capitalize the first letter of each city name.

In [81]:
df = pd.DataFrame({'City' : ['new york', 'paris', 'london']})
df

       City
0  new york
1     paris
2    london

In [83]:
df['City'] = df['City'].apply(lambda x : x.title())
df

       City
0  New York
1     Paris
2    London